Revit 2027 API
DocumentChangedEventArgs.GetModifiedElementIds(ElementFilter) Method
 Returns set of elements that were modified according to the given element filter.
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ICollection<ElementId> GetModifiedElementIds(
	ElementFilter filter
)
Public Function GetModifiedElementIds (
	filter As ElementFilter
) As ICollection(Of ElementId)
public:
ICollection<ElementId^>^ GetModifiedElementIds(
	ElementFilter^ filter
)
member GetModifiedElementIds :
        filter : ElementFilter -> ICollection<ElementId>
Parameters
filter ElementFilter
 The element filter to be applied.
Return Value
ICollection<ElementId>
 The set of ElementId for modified elements that pass the filter. Returns empty set if no elements are found which pass the filter.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
DocumentChangedEventArgs Class
GetModifiedElementIds Overload
Autodesk.Revit.DB.Events Namespace